
## Plan Result (list-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/5722)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 0 to change, 12 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5
  * pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23
  * pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197
* Delete
  * aws_codepipeline.listapi_codepipeline_codepipeline_D8E1DCC8
  * aws_iam_role.listapi_codepipeline_codepipelinerole_EBEA3949
  * aws_iam_role_policy.listapi_codepipeline_codepipelinerolepolicy_415F7D5C
  * aws_s3_bucket.listapi_codepipeline_codepipelinebucket_47D128D9
  * pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4
  * pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54
  * pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B
  * pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
  * null_resource.application_ecs_service_create-task-definition-file_6BADBAF7
* Move
  * aws_acm_certificate.listapi_application_albcertificate_2023E490 => aws_acm_certificate.application_alb_certificate_93966247
  * aws_acm_certificate_validation.listapi_application_albcertificate_certificatevalidation_3F8E0455 => aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
  * aws_alb.listapi_application_applicationloadbalancer_alb_3DFD7FEC => aws_alb.application_application_load_balancer_alb_05EA9801
  * aws_alb_listener.listapi_application_listenerhttp_9FB57557 => aws_alb_listener.application_listener_http_D74EC0ED
  * aws_alb_listener.listapi_application_listenerhttps_68D78D4C => aws_alb_listener.application_listener_https_D31CB055
  * aws_alb_listener_rule.listapi_application_ecsservice_listenerrule_A08AAD77 => aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
  * aws_alb_target_group.listapi_application_ecsservice_bluetargetgroup_ecstargetgroup_D3F21073 => aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
  * aws_alb_target_group.listapi_application_ecsservice_greentargetgroup_ecstargetgroup_9168F472 => aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
  * aws_appautoscaling_policy.listapi_application_autoscaling_scaleinpolicy_17633771 => aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
  * aws_appautoscaling_policy.listapi_application_autoscaling_scaleoutpolicy_0455EC2A => aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
  * aws_appautoscaling_target.listapi_application_autoscaling_autoscalingtarget_A13E43E2 => aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
  * aws_cloudwatch_dashboard.listapi_application_cloudwatchdashboard_45A0DCA6 => aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
  * aws_cloudwatch_log_group.listapi_apploggroup_BBE58EB3 => aws_cloudwatch_log_group.app-log-group
  * aws_cloudwatch_log_group.listapi_application_ecsservice_ecsawsotelcollector_A8CE2BF4 => aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2
  * aws_cloudwatch_metric_alarm.listapi_application_alarmhttptarget5xxerrorrate_51E48AC5 => aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0
  * aws_cloudwatch_metric_alarm.listapi_application_autoscaling_scaleinalarm_01AC8136 => aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
  * aws_cloudwatch_metric_alarm.listapi_application_autoscaling_scaleoutalarm_F9CD8CA0 => aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
  * aws_codedeploy_app.listapi_application_ecsservice_ecscodedeploy_ecscodedeploy_7FC9A4EE => aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
  * aws_codedeploy_deployment_group.listapi_application_ecsservice_ecscodedeploy_ecscodedeploydeploymentgroup_13BDA582 => aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
  * aws_codestarnotifications_notification_rule.listapi_application_ecsservice_ecscodedeploy_ecscodedeploynotifications_4AD6FC64 => aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
  * aws_ecr_lifecycle_policy.listapi_application_ecsservice_ecrapp_ecrrepolifecyclepolicy_E66C0795 => aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7
  * aws_ecr_repository.listapi_application_ecsservice_ecrapp_ecrrepo_73B18316 => aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0
  * aws_ecs_cluster.listapi_application_ecscluster_A1983396 => aws_ecs_cluster.application_ecs_cluster_4DC6EFB3
  * aws_ecs_service.listapi_application_ecsservice_ecsservice_6C17AC39 => aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
  * aws_ecs_task_definition.listapi_application_ecsservice_ecstask_A6E70305 => aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_iam_policy.listapi_application_ecsservice_ecsiam_ecstaskexecutionrolepolicy_AA543926 => aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
  * aws_iam_policy.listapi_application_ecsservice_ecsiam_ecstaskrolepolicy_A1A80785 => aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
  * aws_iam_role.listapi_application_ecsservice_ecsiam_ecsexecutionrole_F60AC496 => aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA
  * aws_iam_role.listapi_application_ecsservice_ecsiam_ecstaskrole_A1567FFA => aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED
  * aws_iam_role.listapi_application_ecsservice_ecscodedeploy_ecscodedeployrole_FC3382A0 => aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3
  * aws_iam_role_policy_attachment.listapi_application_ecsservice_ecsiam_ecstaskcustomattachment_CEB16D7E => aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355
  * aws_iam_role_policy_attachment.listapi_application_ecsservice_ecsiam_ecstaskexecutioncustomattachment_7AA4037C => aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E
  * aws_iam_role_policy_attachment.listapi_application_ecsservice_ecsiam_ecstaskexecutiondefaultattachment_4864174D => aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF
  * aws_iam_role_policy_attachment.listapi_application_ecsservice_ecscodedeploy_ecscodedeployroleattachment_D8F9002E => aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725
  * aws_route53_record.listapi_application_albcertificate_certificaterecord_A853F43C => aws_route53_record.application_alb_certificate_certificate_record_51B45CF2
  * aws_route53_record.listapi_application_albrecord_3FEC53BB => aws_route53_record.application_alb_record_8EA9D3F9
  * aws_route53_record.listapi_application_basedns_subhostedzonens_437DF59C => aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22
  * aws_route53_zone.listapi_application_basedns_subhostedzone_65912413 => aws_route53_zone.application_base_dns_subhosted_zone_77521D1C
  * aws_security_group.listapi_application_applicationloadbalancer_albsecuritygroup_1977B65E => aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
  * aws_security_group.listapi_application_ecsservice_ecssecuritygroup_F5081C30 => aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
  * aws_sns_topic.listapi_pagerduty_alarmcriticaltopic_63004665 => aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
  * aws_sns_topic.listapi_pagerduty_alarmnoncriticaltopic_113F0F31 => aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
  * aws_sns_topic_subscription.listapi_pagerduty_alarmcriticalsubscription_049DA033 => aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84
  * aws_sns_topic_subscription.listapi_pagerduty_alarmnoncriticalsubscription_CB7F35B6 => aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B
  * null_resource.listapi_application_ecsservice_createtaskdefinitionfile_E4E04DD8 => null_resource.application_ecs_service_create-task-definition-file_6BADBAF7
  * pagerduty_service.listapi_pagerduty_pagerdutycritical_A80B75D9 => pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
  * pagerduty_service.listapi_pagerduty_pagerdutynoncritical_8B103450 => pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_acm_certificate.listapi_application_albcertificate_2023E490 has moved to aws_acm_certificate.application_alb_certificate_93966247
    resource "aws_acm_certificate" "application_alb_certificate_93966247" {
        id                        = "arn:aws:acm:us-east-1:996905175585:certificate/87f87d3f-a6a3-4115-8214-b60ff0de36df"
        tags                      = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_acm_certificate_validation.listapi_application_albcertificate_certificatevalidation_3F8E0455 has moved to aws_acm_certificate_validation.application_alb_certificate_certificate_validation_25DAB195
    resource "aws_acm_certificate_validation" "application_alb_certificate_certificate_validation_25DAB195" {
        id                      = "2022-04-17 04:23:30.273 +0000 UTC"
        # (2 unchanged attributes hidden)
    }

  # aws_alb.listapi_application_applicationloadbalancer_alb_3DFD7FEC has moved to aws_alb.application_application_load_balancer_alb_05EA9801
    resource "aws_alb" "application_application_load_balancer_alb_05EA9801" {
        id                                          = "arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16"
        name                                        = "LSTAPI2021051718033188480000000b"
        tags                                        = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # aws_alb_listener.listapi_application_listenerhttp_9FB57557 has moved to aws_alb_listener.application_listener_http_D74EC0ED
    resource "aws_alb_listener" "application_listener_http_D74EC0ED" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/87fcc9c080c57013"
        tags              = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_alb_listener.listapi_application_listenerhttps_68D78D4C has moved to aws_alb_listener.application_listener_https_D31CB055
    resource "aws_alb_listener" "application_listener_https_D31CB055" {
        id                = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/ef18393dce985407"
        tags              = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_listener_rule.listapi_application_ecsservice_listenerrule_A08AAD77 has moved to aws_alb_listener_rule.application_ecs_service_listener_rule_903F815F
    resource "aws_alb_listener_rule" "application_ecs_service_listener_rule_903F815F" {
        id           = "arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/LSTAPI2021051718033188480000000b/0ea6ec498c75bd16/ef18393dce985407/01d12b3e75bede46"
        tags         = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_alb_target_group.listapi_application_ecsservice_bluetargetgroup_ecstargetgroup_D3F21073 has moved to aws_alb_target_group.application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B
    resource "aws_alb_target_group" "application_ecs_service_blue_target_group_ecs_target_group_4A9BF49B" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/LSTAPI20210517180330504500000003/f9f237aa4631b55a"
        name                               = "LSTAPI20210517180330504500000003"
        tags                               = {
            "environment" = "Prod"
            "service"     = "ListAPI"
            "type"        = "blue"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_alb_target_group.listapi_application_ecsservice_greentargetgroup_ecstargetgroup_9168F472 has moved to aws_alb_target_group.application_ecs_service_green_target_group_ecs_target_group_4E06DCA6
    resource "aws_alb_target_group" "application_ecs_service_green_target_group_ecs_target_group_4E06DCA6" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/LSTAPI20210517180330798400000006/00d747ba1046109d"
        name                               = "LSTAPI20210517180330798400000006"
        tags                               = {
            "environment" = "Prod"
            "service"     = "ListAPI"
            "type"        = "green"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_appautoscaling_policy.listapi_application_autoscaling_scaleinpolicy_17633771 has moved to aws_appautoscaling_policy.application_autoscaling_scale_in_policy_BF273511
    resource "aws_appautoscaling_policy" "application_autoscaling_scale_in_policy_BF273511" {
        id                 = "ListAPI-Prod-ScaleInPolicy"
        name               = "ListAPI-Prod-ScaleInPolicy"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_policy.listapi_application_autoscaling_scaleoutpolicy_0455EC2A has moved to aws_appautoscaling_policy.application_autoscaling_scale_out_policy_D03900A2
    resource "aws_appautoscaling_policy" "application_autoscaling_scale_out_policy_D03900A2" {
        id                 = "ListAPI-Prod-ScaleOutPolicy"
        name               = "ListAPI-Prod-ScaleOutPolicy"
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.listapi_application_autoscaling_autoscalingtarget_A13E43E2 has moved to aws_appautoscaling_target.application_autoscaling_autoscaling_target_42BF5C99
    resource "aws_appautoscaling_target" "application_autoscaling_autoscaling_target_42BF5C99" {
        id                 = "service/ListAPI-Prod/ListAPI-Prod"
        tags               = {}
        # (8 unchanged attributes hidden)
    }

  # aws_cloudwatch_dashboard.listapi_application_cloudwatchdashboard_45A0DCA6 has moved to aws_cloudwatch_dashboard.application_cloudwatch-dashboard_1F3DC0ED
    resource "aws_cloudwatch_dashboard" "application_cloudwatch-dashboard_1F3DC0ED" {
        id             = "ListAPI-Prod"
        # (3 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.listapi_apploggroup_BBE58EB3 has moved to aws_cloudwatch_log_group.app-log-group
    resource "aws_cloudwatch_log_group" "app-log-group" {
        id                = "/Backend/ListAPI-Prod/ecs/app"
        name              = "/Backend/ListAPI-Prod/ecs/app"
        tags              = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.listapi_application_ecsservice_ecsawsotelcollector_A8CE2BF4 has moved to aws_cloudwatch_log_group.application_ecs_service_ecs-aws-otel-collector_9F54C4B2
    resource "aws_cloudwatch_log_group" "application_ecs_service_ecs-aws-otel-collector_9F54C4B2" {
        id                = "/ecs/ListAPI-Prod/aws-otel-collector20221205232452338400000001"
        name              = "/ecs/ListAPI-Prod/aws-otel-collector20221205232452338400000001"
        tags              = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.listapi_application_alarmhttptarget5xxerrorrate_51E48AC5 has moved to aws_cloudwatch_metric_alarm.application_alarm-httptarget5xxerrorrate_F94D87C0
    resource "aws_cloudwatch_metric_alarm" "application_alarm-httptarget5xxerrorrate_F94D87C0" {
        id                        = "ListAPI-Prod-Alarm-HTTPTarget5xxErrorRate"
        tags                      = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.listapi_application_autoscaling_scaleinalarm_01AC8136 has moved to aws_cloudwatch_metric_alarm.application_autoscaling_scale_in_alarm_850BE3A1
    resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_in_alarm_850BE3A1" {
        id                        = "ListAPI-Prod Service Low CPU"
        tags                      = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.listapi_application_autoscaling_scaleoutalarm_F9CD8CA0 has moved to aws_cloudwatch_metric_alarm.application_autoscaling_scale_out_alarm_E40FCBA0
    resource "aws_cloudwatch_metric_alarm" "application_autoscaling_scale_out_alarm_E40FCBA0" {
        id                        = "ListAPI-Prod Service High CPU"
        tags                      = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (18 unchanged attributes hidden)
    }

  # aws_codedeploy_app.listapi_application_ecsservice_ecscodedeploy_ecscodedeploy_7FC9A4EE has moved to aws_codedeploy_app.application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF
    resource "aws_codedeploy_app" "application_ecs_service_ecs_codedeploy_ecs_code_deploy_C2F7CBCF" {
        id               = "0a11e0c9-11d2-41ae-8572-fb37ee719488:ListAPI-Prod-ECS"
        name             = "ListAPI-Prod-ECS"
        tags             = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_deployment_group.listapi_application_ecsservice_ecscodedeploy_ecscodedeploydeploymentgroup_13BDA582 has moved to aws_codedeploy_deployment_group.application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247
    resource "aws_codedeploy_deployment_group" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_48384247" {
        id                          = "8b8a2c44-f666-4981-8bb9-800ea7f82752"
        tags                        = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_codepipeline.listapi_codepipeline_codepipeline_D8E1DCC8 will be destroyed
  # (because aws_codepipeline.listapi_codepipeline_codepipeline_D8E1DCC8 is not in configuration)
  - resource "aws_codepipeline" "listapi_codepipeline_codepipeline_D8E1DCC8" {
      - arn      = "arn:aws:codepipeline:us-east-1:996905175585:ListAPI-Prod-CodePipeline" -> null
      - id       = "ListAPI-Prod-CodePipeline" -> null
      - name     = "ListAPI-Prod-CodePipeline" -> null
      - role_arn = "arn:aws:iam::996905175585:role/ListAPI-Prod-CodePipelineRole" -> null
      - tags     = {} -> null
      - tags_all = {} -> null

      - artifact_store {
          - location = "pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a" -> null
          - type     = "S3" -> null

          - encryption_key {
              - id   = "arn:aws:kms:us-east-1:996905175585:alias/aws/s3" -> null
              - type = "KMS" -> null
            }
        }

      - stage {
          - name = "Source" -> null

          - action {
              - category         = "Source" -> null
              - configuration    = {
                  - "BranchName"       = "main"
                  - "ConnectionArn"    = "arn:aws:codestar-connections:us-east-1:996905175585:connection/5fa5aa2b-a2d2-43e3-ab5a-72ececfc1870"
                  - "DetectChanges"    = "false"
                  - "FullRepositoryId" = "pocket/list-api"
                } -> null
              - input_artifacts  = [] -> null
              - name             = "GitHub_Checkout" -> null
              - namespace        = "SourceVariables" -> null
              - output_artifacts = [
                  - "SourceOutput",
                ] -> null
              - owner            = "AWS" -> null
              - provider         = "CodeStarSourceConnection" -> null
              - run_order        = 1 -> null
              - version          = "1" -> null
            }
        }
      - stage {
          - name = "Deploy" -> null

          - action {
              - category         = "Build" -> null
              - configuration    = {
                  - "EnvironmentVariables" = jsonencode(
                        [
                          - {
                              - name  = "GIT_BRANCH"
                              - value = "#{SourceVariables.BranchName}"
                            },
                        ]
                    )
                  - "ProjectName"          = "ListAPI-Prod"
                } -> null
              - input_artifacts  = [
                  - "SourceOutput",
                ] -> null
              - name             = "Deploy_CDK" -> null
              - output_artifacts = [
                  - "CodeBuildOutput",
                ] -> null
              - owner            = "AWS" -> null
              - provider         = "CodeBuild" -> null
              - run_order        = 1 -> null
              - version          = "1" -> null
            }
          - action {
              - category         = "Deploy" -> null
              - configuration    = {
                  - "AppSpecTemplateArtifact"        = "CodeBuildOutput"
                  - "AppSpecTemplatePath"            = "appspec.json"
                  - "ApplicationName"                = "ListAPI-Prod-ECS"
                  - "DeploymentGroupName"            = "ListAPI-Prod-ECS"
                  - "TaskDefinitionTemplateArtifact" = "CodeBuildOutput"
                  - "TaskDefinitionTemplatePath"     = "taskdef.json"
                } -> null
              - input_artifacts  = [
                  - "CodeBuildOutput",
                ] -> null
              - name             = "Deploy_ECS" -> null
              - output_artifacts = [] -> null
              - owner            = "AWS" -> null
              - provider         = "CodeDeployToECS" -> null
              - run_order        = 2 -> null
              - version          = "1" -> null
            }
        }
    }

  # aws_codestarnotifications_notification_rule.listapi_application_ecsservice_ecscodedeploy_ecscodedeploynotifications_4AD6FC64 has moved to aws_codestarnotifications_notification_rule.application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE
    resource "aws_codestarnotifications_notification_rule" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_CB44EADE" {
        id             = "arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/add90c251fbc8ce24938c7ee083001d39b532743"
        name           = "ListAPI-Prod-ECS"
        tags           = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecr_lifecycle_policy.listapi_application_ecsservice_ecrapp_ecrrepolifecyclepolicy_E66C0795 has moved to aws_ecr_lifecycle_policy.application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7
    resource "aws_ecr_lifecycle_policy" "application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_CCDF75B7" {
        id          = "listapi-prod-app"
        # (3 unchanged attributes hidden)
    }

  # aws_ecr_repository.listapi_application_ecsservice_ecrapp_ecrrepo_73B18316 has moved to aws_ecr_repository.application_ecs_service_ecr-app_ecr-repo_ABFE17F0
    resource "aws_ecr_repository" "application_ecs_service_ecr-app_ecr-repo_ABFE17F0" {
        id                   = "listapi-prod-app"
        name                 = "listapi-prod-app"
        tags                 = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_cluster.listapi_application_ecscluster_A1983396 has moved to aws_ecs_cluster.application_ecs_cluster_4DC6EFB3
    resource "aws_ecs_cluster" "application_ecs_cluster_4DC6EFB3" {
        id       = "arn:aws:ecs:us-east-1:996905175585:cluster/ListAPI-Prod"
        name     = "ListAPI-Prod"
        tags     = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.listapi_application_ecsservice_ecsservice_6C17AC39 has moved to aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
    resource "aws_ecs_service" "application_ecs_service_ecs-service_A8BAB5F4" {
        id                                 = "arn:aws:ecs:us-east-1:996905175585:service/ListAPI-Prod/ListAPI-Prod"
        name                               = "ListAPI-Prod"
        tags                               = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
  # (moved from aws_ecs_task_definition.listapi_application_ecsservice_ecstask_A6E70305)
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod:914" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (6 unchanged elements hidden)
                        {
                            name  = "OTLP_COLLECTOR_HOST"
                            value = "localhost"
                        },
                      ~ {
                            name  = "RELEASE_SHA"
                          ~ value = "60decd652d567b81edc4fc284ae59d4409076c0a" -> "e339f66e5aa77c203b64da1c54b84f4107852d6e"
                        },
                        {
                            name  = "SQS_BATCH_DELETE_QUEUE_URL"
                            value = "https://sqs.us-east-1.amazonaws.com/996905175585/ListAPI-Prod-Sqs-Batch-Delete-Consumer-Queue"
                        },
                        # (2 unchanged elements hidden)
                    ]
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ListAPI-Prod" -> (known after apply)
      ~ revision                 = 914 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_iam_policy.listapi_application_ecsservice_ecsiam_ecstaskexecutionrolepolicy_AA543926 has moved to aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77
    resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-execution-role-policy_2D469A77" {
        id        = "arn:aws:iam::996905175585:policy/ListAPI-Prod-TaskExecutionRolePolicy"
        name      = "ListAPI-Prod-TaskExecutionRolePolicy"
        tags      = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.listapi_application_ecsservice_ecsiam_ecstaskrolepolicy_A1A80785 has moved to aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
    resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
        id        = "arn:aws:iam::996905175585:policy/ListAPI-Prod-TaskRolePolicy"
        name      = "ListAPI-Prod-TaskRolePolicy"
        tags      = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_role.listapi_application_ecsservice_ecsiam_ecsexecutionrole_F60AC496 has moved to aws_iam_role.application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA
    resource "aws_iam_role" "application_ecs_service_ecs-iam_ecs-execution-role_FB754BAA" {
        id                    = "ListAPI-Prod-TaskExecutionRole"
        name                  = "ListAPI-Prod-TaskExecutionRole"
        tags                  = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.listapi_application_ecsservice_ecsiam_ecstaskrole_A1567FFA has moved to aws_iam_role.application_ecs_service_ecs-iam_ecs-task-role_A72990ED
    resource "aws_iam_role" "application_ecs_service_ecs-iam_ecs-task-role_A72990ED" {
        id                    = "ListAPI-Prod-TaskRole"
        name                  = "ListAPI-Prod-TaskRole"
        tags                  = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.listapi_application_ecsservice_ecscodedeploy_ecscodedeployrole_FC3382A0 has moved to aws_iam_role.application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3
    resource "aws_iam_role" "application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_175DB7D3" {
        id                    = "ListAPI-Prod-ECSCodeDeployRole"
        name                  = "ListAPI-Prod-ECSCodeDeployRole"
        tags                  = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.listapi_codepipeline_codepipelinerole_EBEA3949 will be destroyed
  # (because aws_iam_role.listapi_codepipeline_codepipelinerole_EBEA3949 is not in configuration)
  - resource "aws_iam_role" "listapi_codepipeline_codepipelinerole_EBEA3949" {
      - arn                   = "arn:aws:iam::996905175585:role/ListAPI-Prod-CodePipelineRole" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "codepipeline.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2021-05-17T18:03:30Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ListAPI-Prod-CodePipelineRole" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ListAPI-Prod-CodePipelineRole" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA6QHBNZIQSEX2ZXWPX" -> null

      - inline_policy {
          - name   = "ListAPI-Prod-CodePipeline-Role-Policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "codestar-connections:UseConnection"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:codestar-connections:us-east-1:996905175585:connection/5fa5aa2b-a2d2-43e3-ab5a-72ececfc1870"
                          - Sid      = ""
                        },
                      - {
                          - Action   = [
                              - "codebuild:StartBuildBatch",
                              - "codebuild:StartBuild",
                              - "codebuild:BatchGetBuilds",
                              - "codebuild:BatchGetBuildBatches",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:codebuild:*:*:project/ListAPI-Prod*"
                          - Sid      = ""
                        },
                      - {
                          - Action   = [
                              - "codedeploy:RegisterApplicationRevision",
                              - "codedeploy:GetDeploymentConfig",
                              - "codedeploy:GetDeployment",
                              - "codedeploy:GetApplicationRevision",
                              - "codedeploy:GetApplication",
                              - "codedeploy:CreateDeployment",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:codedeploy:*:*:deploymentgroup:ListAPI-Prod-ECS/ListAPI-Prod-ECS",
                              - "arn:aws:codedeploy:*:*:deploymentconfig:*",
                              - "arn:aws:codedeploy:*:*:application:ListAPI-Prod-ECS",
                            ]
                          - Sid      = ""
                        },
                      - {
                          - Action   = [
                              - "s3:PutObjectAcl",
                              - "s3:PutObject",
                              - "s3:GetObjectVersion",
                              - "s3:GetObject",
                              - "s3:GetBucketVersioning",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a/*",
                              - "arn:aws:s3:::pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a",
                            ]
                          - Sid      = ""
                        },
                      - {
                          - Action    = "iam:PassRole"
                          - Condition = {
                              - StringEqualsIfExists = {
                                  - "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                                }
                            }
                          - Effect    = "Allow"
                          - Resource  = "*"
                          - Sid       = ""
                        },
                      - {
                          - Action   = "ecs:RegisterTaskDefinition"
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.listapi_codepipeline_codepipelinerolepolicy_415F7D5C will be destroyed
  # (because aws_iam_role_policy.listapi_codepipeline_codepipelinerolepolicy_415F7D5C is not in configuration)
  - resource "aws_iam_role_policy" "listapi_codepipeline_codepipelinerolepolicy_415F7D5C" {
      - id     = "ListAPI-Prod-CodePipelineRole:ListAPI-Prod-CodePipeline-Role-Policy" -> null
      - name   = "ListAPI-Prod-CodePipeline-Role-Policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "codestar-connections:UseConnection"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:codestar-connections:us-east-1:996905175585:connection/5fa5aa2b-a2d2-43e3-ab5a-72ececfc1870"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "codebuild:StartBuildBatch",
                          - "codebuild:StartBuild",
                          - "codebuild:BatchGetBuilds",
                          - "codebuild:BatchGetBuildBatches",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:codebuild:*:*:project/ListAPI-Prod*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "codedeploy:RegisterApplicationRevision",
                          - "codedeploy:GetDeploymentConfig",
                          - "codedeploy:GetDeployment",
                          - "codedeploy:GetApplicationRevision",
                          - "codedeploy:GetApplication",
                          - "codedeploy:CreateDeployment",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:codedeploy:*:*:deploymentgroup:ListAPI-Prod-ECS/ListAPI-Prod-ECS",
                          - "arn:aws:codedeploy:*:*:deploymentconfig:*",
                          - "arn:aws:codedeploy:*:*:application:ListAPI-Prod-ECS",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "s3:PutObjectAcl",
                          - "s3:PutObject",
                          - "s3:GetObjectVersion",
                          - "s3:GetObject",
                          - "s3:GetBucketVersioning",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a/*",
                          - "arn:aws:s3:::pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action    = "iam:PassRole"
                      - Condition = {
                          - StringEqualsIfExists = {
                              - "iam:PassedToService" = "ecs-tasks.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = ""
                    },
                  - {
                      - Action   = "ecs:RegisterTaskDefinition"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "ListAPI-Prod-CodePipelineRole" -> null
    }

  # aws_iam_role_policy_attachment.listapi_application_ecsservice_ecsiam_ecstaskcustomattachment_CEB16D7E has moved to aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355
    resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-custom-attachment_F8DDD355" {
        id         = "ListAPI-Prod-TaskRole-20210517180331752000000009"
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.listapi_application_ecsservice_ecsiam_ecstaskexecutioncustomattachment_7AA4037C has moved to aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E
    resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_046B7E2E" {
        id         = "ListAPI-Prod-TaskExecutionRole-2021051718033188520000000c"
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.listapi_application_ecsservice_ecsiam_ecstaskexecutiondefaultattachment_4864174D has moved to aws_iam_role_policy_attachment.application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF
    resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_99A621FF" {
        id         = "ListAPI-Prod-TaskExecutionRole-2021051718033181400000000a"
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.listapi_application_ecsservice_ecscodedeploy_ecscodedeployroleattachment_D8F9002E has moved to aws_iam_role_policy_attachment.application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725
    resource "aws_iam_role_policy_attachment" "application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_1A1D5725" {
        id         = "ListAPI-Prod-ECSCodeDeployRole-20210517180331622800000008"
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.listapi_application_albcertificate_certificaterecord_A853F43C has moved to aws_route53_record.application_alb_certificate_certificate_record_51B45CF2
    resource "aws_route53_record" "application_alb_certificate_certificate_record_51B45CF2" {
        id                               = "Z0473210YV8ZG0O9C5XY__266755124b347d7fb2b103c57e10b4ad.list-api.readitlater.com._CNAME"
        name                             = "_266755124b347d7fb2b103c57e10b4ad.list-api.readitlater.com"
        # (6 unchanged attributes hidden)
    }

  # aws_route53_record.listapi_application_albrecord_3FEC53BB has moved to aws_route53_record.application_alb_record_8EA9D3F9
    resource "aws_route53_record" "application_alb_record_8EA9D3F9" {
        id                               = "Z0473210YV8ZG0O9C5XY_list-api.readitlater.com_A_1"
        name                             = "list-api.readitlater.com"
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_route53_record.listapi_application_basedns_subhostedzonens_437DF59C has moved to aws_route53_record.application_base_dns_subhosted_zone_ns_DFB88A22
    resource "aws_route53_record" "application_base_dns_subhosted_zone_ns_DFB88A22" {
        id                               = "Z2BHWTOWFVNW3M_list-api.readitlater.com_NS"
        name                             = "list-api.readitlater.com"
        # (6 unchanged attributes hidden)
    }

  # aws_route53_zone.listapi_application_basedns_subhostedzone_65912413 has moved to aws_route53_zone.application_base_dns_subhosted_zone_77521D1C
    resource "aws_route53_zone" "application_base_dns_subhosted_zone_77521D1C" {
        id                  = "Z0473210YV8ZG0O9C5XY"
        name                = "list-api.readitlater.com"
        tags                = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_s3_bucket.listapi_codepipeline_codepipelinebucket_47D128D9 will be destroyed
  # (because aws_s3_bucket.listapi_codepipeline_codepipelinebucket_47D128D9 is not in configuration)
  - resource "aws_s3_bucket" "listapi_codepipeline_codepipelinebucket_47D128D9" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a" -> null
      - bucket                      = "pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a" -> null
      - bucket_domain_name          = "pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a.s3.amazonaws.com" -> null
      - bucket_prefix               = "pocket-codepipeline-d24c11" -> null
      - bucket_regional_domain_name = "pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a.s3.us-east-1.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z3AQBSTGFYJSTF" -> null
      - id                          = "pocket-codepipeline-d24c1101d114ac3ba176caa820071b8a" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "92f1efb5501a01f6ebb8e3628131c3483688d3e5ca1a7c175420c565a06a6616" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_security_group.listapi_application_applicationloadbalancer_albsecuritygroup_1977B65E has moved to aws_security_group.application_application_load_balancer_alb_security_group_7B45D070
    resource "aws_security_group" "application_application_load_balancer_alb_security_group_7B45D070" {
        id                     = "sg-06f55983caa3fb22b"
        name                   = "ListAPI-Prod-HTTP/S Security Group20210517180330682300000004"
        tags                   = {
            "Name"        = "ListAPI-Prod-HTTP/S Security Group"
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.listapi_application_ecsservice_ecssecuritygroup_F5081C30 has moved to aws_security_group.application_ecs_service_ecs_security_group_231C6B1E
    resource "aws_security_group" "application_ecs_service_ecs_security_group_231C6B1E" {
        id                     = "sg-0d41f0d58ada8d798"
        name                   = "ListAPI-Prod-ECSSecurityGroup2021051718033192790000000d"
        tags                   = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_sns_topic.listapi_pagerduty_alarmcriticaltopic_63004665 has moved to aws_sns_topic.pagerduty_alarm-critical-topic_F1534579
    resource "aws_sns_topic" "pagerduty_alarm-critical-topic_F1534579" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical"
        name                                     = "ListAPI-Prod-Infrastructure-Alarm-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic.listapi_pagerduty_alarmnoncriticaltopic_113F0F31 has moved to aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3
    resource "aws_sns_topic" "pagerduty_alarm-non-critical-topic_53C1A3B3" {
        id                                       = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical"
        name                                     = "ListAPI-Prod-Infrastructure-Alarm-Non-Critical"
        tags                                     = {}
        # (12 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 must be replaced
  # (moved from aws_sns_topic_subscription.listapi_pagerduty_alarmcriticalsubscription_049DA033)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical:2eee1689-5e51-4426-9727-fc00905e0bec" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/d52e1706e74a400cc06f850bffbce11d/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Critical:2eee1689-5e51-4426-9727-fc00905e0bec" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B must be replaced
  # (moved from aws_sns_topic_subscription.listapi_pagerduty_alarmnoncriticalsubscription_CB7F35B6)
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-non-critical-subscription_4702677B" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical:1960b123-5622-4a4a-9202-8057a4a12dc3" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      ~ endpoint                        = "https://events.pagerduty.com/integration/c4635e7108ca4d0dc07931cfcd54eeea/enqueue" # forces replacement -> (known after apply) # forces replacement
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:ListAPI-Prod-Infrastructure-Alarm-Non-Critical:1960b123-5622-4a4a-9202-8057a4a12dc3" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  # (moved from local_file.listapi_application_ecsservice_appspec_5A331B8C)
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.application_ecs_service_create-task-definition-file_6BADBAF7 must be replaced
  # (moved from null_resource.listapi_application_ecsservice_createtaskdefinitionfile_E4E04DD8)
-/+ resource "null_resource" "application_ecs_service_create-task-definition-file_6BADBAF7" {
      ~ id       = "4245034133213406347" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "alwaysRun" = "2023-12-11T17:39:15Z" -> (known after apply)
        }
    }

  # pagerduty_service.listapi_pagerduty_pagerdutycritical_A80B75D9 has moved to pagerduty_service.pagerduty_pagerduty-critical_464EE7CD
    resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
        id                      = "PGR7P9M"
        name                    = "ListAPI-Prod-PagerDuty-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service.listapi_pagerduty_pagerdutynoncritical_8B103450 has moved to pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938
    resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
        id                      = "PCEJOXZ"
        name                    = "ListAPI-Prod-PagerDuty-Non-Critical"
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4 will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4 is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutycloudwatchF353A394critical_75159CC4" {
      - html_url        = "https://mozilla.pagerduty.com/services/PGR7P9M/integrations/POXWHFA" -> null
      - id              = "POXWHFA" -> null
      - integration_key = "d52e1706e74a400cc06f850bffbce11d" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PGR7P9M" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54 will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54 is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutycloudwatchF353A394noncritical_2861FC54" {
      - html_url        = "https://mozilla.pagerduty.com/services/PCEJOXZ/integrations/P4OKGQK" -> null
      - id              = "P4OKGQK" -> null
      - integration_key = "c4635e7108ca4d0dc07931cfcd54eeea" -> null
      - name            = "Amazon CloudWatch" -> null
      - service         = "PCEJOXZ" -> null
      - type            = "event_transformer_api_inbound_integration" -> null
      - vendor          = "PZQ6AUS" -> null
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutysentryC935FABEcritical_6A6D1B3B" {
      - html_url        = "https://mozilla.pagerduty.com/services/PGR7P9M/integrations/PS6HIV0" -> null
      - id              = "PS6HIV0" -> null
      - integration_key = "e3995ce53f70470dd06c042a67bfa6da" -> null
      - name            = "Sentry" -> null
      - service         = "PGR7P9M" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC will be destroyed
  # (because pagerduty_service_integration.listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC is not in configuration)
  - resource "pagerduty_service_integration" "listapi_pagerduty_listapipagerdutysentryC935FABEnoncritical_FBD724EC" {
      - html_url        = "https://mozilla.pagerduty.com/services/PCEJOXZ/integrations/P7L8H3N" -> null
      - id              = "P7L8H3N" -> null
      - integration_key = "943753061c0c4600d0a8c4e5811e12b5" -> null
      - name            = "Sentry" -> null
      - service         = "PCEJOXZ" -> null
      - type            = "app_event_transform_inbound_integration" -> null
      - vendor          = "PKAPG94" -> null
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PGR7P9M"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = "PCEJOXZ"
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PGR7P9M"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = "PCEJOXZ"
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 9 to add, 0 to change, 12 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1971, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1971:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 1971, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
 1971:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"83320d96-9dcb-4fe5-ace4-62322c197a90","JobName":"list-api_infrastructure_plan_prod","PRNumber":40,"Program":"tfcmt","SHA1":"e339f66e5aa77c203b64da1c54b84f4107852d6e","Target":"list-api-cdk","Vars":{}} -->